### Terraform Plan 📋

<details>
<summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_virtual_network.example will be created
  + resource "azurerm_virtual_network" "example" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "westeurope"
      + name                           = "example-vnet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "example-resources"
      + subnet                         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

**Plan Status:** success
**Workflow:** [#49](https://github.com/m0ntl/TF-presentation/actions/runs/20693500518)
